package main

import "fmt"

func main() {
Loop1:
	for i := 1; i <= 3; i++ {
		fmt.Printf("Loop1: %d\n", i)
		for j := 1; j <= 3; j++ {
			fmt.Printf("\tLoop2: %d\n", j)
			for k := 1; k <= 3; k++ {
				fmt.Printf("\t\tLoop3: %d\n", k)
				if i == 2 && j == 2 && k == 2 {
					break Loop1 // Breaks out of Loop1 and terminates the loops
				}
			}
		}
	}
}

//یعنی برچسب زدن یا نام گذاری کردن هر لوپ با یک اسم و دونقطه «:» برای اینکه
//بتوانیم دستور بدهیم کدام لوپ را بریک کن یا کدام لوپ را کانتینیو کن.
//تا اینکه فقط از درونی ترین لوپ بریک نکند.
// بلکه از هر لوپی (حتی بیرونی ترین لوپ) که تو بخوای بریک کند یا کانتینیو کند.
//الزامی هم ندارد که یک خط قبل از فور بیاید بلکه میتواند در همان خط بیاید.
